;Photobooth
[X2Photobooth]
+m_arrAnimationSparkPoses=(AnimationDisplayName="放下枪 (MEC)")
+m_arrAnimationSparkPoses=(AnimationDisplayName="举起枪 (MEC)")
+m_arrAnimationSparkPoses=(AnimationDisplayName="悠闲 (MEC)")
+m_arrAnimationSparkPoses=(AnimationDisplayName="立正 (MEC)")
+m_arrAnimationSparkPoses=(AnimationDisplayName="两臂并拢 (MEC)")




;Tech
[RM_MecAugmentation X2TechTemplate]
DisplayName="MEC进化论"
Summary="我在我父亲的旧文件中发现了一些东西，一些关于如果自动化SPARK设计不能及时实施的情况下而进行的更铤而走险的的措施。这是一个涉及人与机器融合的项目，能让志愿者过上改造后的生活的一个希望。随着外星人带来的医疗进步，我认为我们可以成为一名有价值的接班人，对志愿者的要求会少一点，但会给他们更多力量。" 


;Facility Upgrade
[RM_MecFoundry X2FacilityUpgradeTemplate]
DisplayName="MEC铸造场"
FacilityName="试验场"
Summary="解锁MEC改造功能。"


;staff slot
[RM_MecAugmentationStaffSlot X2StaffSlotTemplate]
EmptyText="开放：需要士兵"
BonusEmptyText="MEC改造"
BonusText="MEC改造中"
FilledText="%UNITNAME 开始改造!"
LockedText="解锁：购买升级"


;bit abilities for MECs

[MecRocketLauncher X2AbilityTemplate]
LocFriendlyName="火箭发射器"
LocHelpText="向目标区域发射一枚火箭。"

[MecShredderGun X2AbilityTemplate]
LocFriendlyName="粉碎炮"
LocHelpText="在锥形区域发射粉碎炮。"

[MecShredstormCannon X2AbilityTemplate]
LocFriendlyName="碎片风暴加农炮"
LocHelpText="发射碎片风暴加农炮。"

[MecFlamethrower X2AbilityTemplate]
LocFriendlyName="火焰喷射器"
LocHelpText="向锥形区域喷射火焰。"

[MecFlamethrowerMk2 X2AbilityTemplate]
LocFriendlyName="地狱火喷射器"
LocHelpText="向锥形区域喷射火焰。"

[MecBlasterLauncher X2AbilityTemplate]
LocFriendlyName="爆裂飞弹"
LocHelpText="朝目标区域发射一枚制导的爆裂飞弹。"

[MecPlasmaBlaster X2AbilityTemplate]
LocFriendlyName="电浆毁灭炮"
LocHelpText="发射电浆毁灭炮。"

;class abilities
[RM_AbsorptionFields X2AbilityTemplate]
LocFriendlyName="吸收力场"
LocLongDescription="如果攻击超过MEC最大生命值的<Ability:RMAbsorption/>%，它将被限制在这个百分比内，如果它低于0，则为1。"
LocHelpText="将受到的攻击伤害限制为单位当前生命的一定百分比。"
LocFlyOverText="吸收力场"
LocPromotionPopupText="<Bullet/> 使装甲落后的MEC在战场上仍然具有竞争力。<br/>"

[RM_ReactiveTargetingSensors X2AbilityTemplate]
LocFriendlyName="反应传感"
LocLongDescription="每当敌人向MEC开火时，只要MEC还有弹药，它就会反击。"
LocHelpText="用反击来应对针对MEC的攻击。"
LocFlyOverText="反应传感"
LocPromotionPopupText="<Bullet/> 该特技再加上更多的防御特技，可以让一个MEC锁定一个区域而不需要直接进入监视。<br/>"

[RM_BrutalizeProtocol X2AbilityTemplate]
LocFriendlyName="暴力协议"
LocLongDescription="用超频拳击一名有机敌人，对其造成巨大伤害，并迫使<Ability:ClassName/>视距内的任何有机目标进入恐慌。在剩下的任务中造成的近战伤害减少。"
LocHelpText="击杀一个给定的有机目标，并迫使视距内的其他有机目标恐慌。"
LocPromotionPopupText="<Bullet/> 暴力协议每次任务一次充能。时间是明智的，避免遭受太长时间的近战伤害减少。<br/>"

[RM_BrutalizeBlowback X2AbilityTemplate]
LocFriendlyName="损坏手臂"
LocLongDescription="这只手臂被MEC的超频近战攻击损坏，在近战攻击中减少-<Ability:BrutalizeBlowback/>点伤害。"
LocHelpText="这只手臂被MEC的过载近战攻击损坏，在近战攻击中减少-<Ability:BrutalizeBlowback/>点伤害。"


[RM_InTheZone X2AbilityTemplate]
LocFriendlyName="死亡禁区"
LocLongDescription="用你的<ability:WeaponName/>击杀侧翼或暴露的敌人返还花费的行动点数。在某些能力下不起作用。"
LocHelpText="击杀侧翼/暴露目标时恢复行动点。"
LocFlyOverText="死亡禁区"
LocPromotionPopupText="<Bullet/> 奔袭战术和超频核心不会在该区域起作用。<br/>"

[RM_HardenedCore X2AbilityTemplate]
LocFriendlyName="适应核心"
LocLongDescription="MEC士兵装备了超硬的内部构件，使其对暴击免疫。"
LocHelpText="对暴击免疫。"
LocFlyOverText="适应核心"
LocPromotionPopupText="<Bullet/> 当一名MEC士兵不必担心被突然袭击的时候，他可以走很长的路。<br/>"

[RM_OverclockCore X2AbilityTemplate]
LocFriendlyName="超频核心"
LocLongDescription="MEC士兵现在可以访问他们的内部系统，并且可以选择忽略安全限制，以换取对所有可见目标的全面攻击，这将使他们事后变得脆弱。"
LocHelpText="全力以赴对付眼前的一切(直到弹药耗尽)，然后休息一回合。"
LocFlyOverText="超频核心"
LocPromotionPopupText="<Bullet/> 超频核心需要<Ability:SelfAmmoCost/>弹药 ， <Ability:SelfCooldown/>回合冷却。<br/><Bullet/> 超频核心是强大的，当与命中增强器或弹药扩展匣结合，以最大限度地提高火力，但会让MEC在下一个回合容易遭受敌人的火力。<br/>"

[RM_OverheatTrigger X2AbilityTemplate]
LocFriendlyName="过热"
LocLongDescription="超频核心的使用导致这台MEC的装甲因过热而关闭。MEC被眩晕，或者眩晕效果得到缓解失去-50命中。"
LocHelpText="MEC要么无法行动，要么本回合命中极差。"
LocFlyOverText="过热!"


[RM_RepairProtocol X2AbilityTemplate]
LocFriendlyName="维修伺服"
LocLongDescription="BIT装备了自我修复协议的内部版本，允许它在给定的限制下每回合回复一些生命值。"
LocHelpText="每回合回复一些生命，达到一定限度。"
LocFlyOverText="维修伺服"
LocPromotionPopupText="<Bullet/> 每次任务最初限制为+<Ability:RepairProtocol/> , 但随着MEC的护甲等级增加。<br/>"

[RM_MecSteadfast X2AbilityTemplate]
LocFriendlyName="坚定不移"
LocLongDescription="该单位在战斗的恐惧面前变得坚不可摧，并且对恐慌免疫。"
LocHelpText="坚定不移。"
LocFlyOverText="坚定不移"
LocPromotionPopupText="<Bullet/> 可以帮助当该单位出现疲劳或其他情况时，可能会受到各种来源的恐慌影响。<br/>"

[RM_SharpArms X2AbilityTemplate]
LocFriendlyName="神射支架"
LocLongDescription="MEC士兵的武器被改装成更稳定的武器，并允许MEC士兵以额外的命中和暴击率来攻击坚硬的、全掩体的目标。"
LocHelpText="对全掩体目标获得额外命中和暴击。"
LocFlyOverText="神射支架"
LocPromotionPopupText="<Bullet/> 当与守望相结合时很有用：从全掩体跑出的目标更容易击中。<br/>"



[RM_MecDmgControl X2AbilityTemplate]
LocFriendlyName="伤害控制"
LocLongDescription="每次被敌人击中时MEC士兵获得+<Ability:MecDmgControl/>护甲。该效果每次出现都会刷新。"
LocHelpText="被敌人击中时获得护甲。"
LocFlyOverText="伤害控制"
LocPromotionPopupText="<Bullet/> 伤害控制可以极大地提高低阶MEC士兵的生存能力，或者提高高阶MEC士兵的生存能力。<br/>"

[RM_HammerProtocol X2AbilityTemplate]
LocFriendlyName="榔头协议"
LocLongDescription="MEC士兵得到反近战优化，获得50%的抵抗近战攻击和免疫失去意识。"
LocHelpText="对近战攻击有抵抗力，对被击倒有免疫力。"
LocFlyOverText="榔头协议"
LocPromotionPopupText="<Bullet/> 这种能力可以帮助MEC士兵解决他们的一些剩余弱点，而这些弱点并没有被强化。<br/>"

[RM_SelfDefenceProtocol X2AbilityTemplate]
LocFriendlyName="自卫协议"
LocLongDescription="对任何进入近战范围或从近战范围攻击的敌人进行自由拳击。"
LocHelpText="对任何进入近战范围或从近战范围攻击的敌人进行自由拳击。"
LocFlyOverText="自卫协议"
LocPromotionPopupText="<Bullet/> 如果一个敌人在相邻的格子中开始他们的回合，如果该敌人试图攻击<Ability:ClassName/>将触发自卫协议。<br/><Bullet/> 如果一个敌人没有在相邻的格子中开始他们的回合，那么当该敌人进入近战范围时，自卫协议将会触发。<br/>"

[SDPAttack X2AbilityTemplate]
LocFriendlyName="自卫协议"
LocLongDescription="对任何进入近战范围或从近战范围攻击的敌人进行自由拳击。"
LocHelpText="对任何进入近战范围或从近战范围攻击的敌人进行自由拳击。"
LocFlyOverText="自卫协议"
LocPromotionPopupText="<Bullet/> 如果一个敌人在相邻的格子中开始他们的回合，如果该敌人试图攻击<Ability:ClassName/>将触发自卫协议。<br/><Bullet/> 如果一个敌人没有在相邻的格子中开始他们的回合，那么当该敌人进入近战范围时，自卫协议将会触发。<br/>"

[RM_CollateralDamage X2AbilityTemplate]
LocFriendlyName="桥联攻击"
LocLongDescription="在目标位置发射大量子弹，严重破坏目标位置的环境。对里面的目标造成轻微伤害。"
LocHelpText="向目标位置开火，严重破坏或摧毁目标。对目标造成轻微伤害。"
LocFlyOverText="桥联攻击"
LocPromotionPopupText="<Bullet/> 桥联攻击需要<Ability:SelfAmmoCost/>弹药，<Ability:SelfCooldown/>回合冷却。<br/><Bullet/> 桥联攻击会增加对环境的损害，并会摧毁大多数掩体。<br/>"
LocMissMessage="未命中!"

[RM_KineticStrike X2AbilityTemplate]
LocFriendlyName="动能打击"
LocLongDescription="用你的MEC拳头攻击范围内的任何敌人。"
LocHelpText="用你的MEC拳头攻击范围内的任何敌人。"
LocPromotionPopupText="<Bullet/> 它没有XCOM的其他近战攻击的范围，但动能攻击可以造成更大的伤害和消耗一个行动点不会结束回合。<br/>"



[RM_ReactiveArmor X2AbilityTemplate]
LocFriendlyName="活性装甲"
LocLongDescription="MEC士兵的盔甲现在包括多层的活性镀层，使盔甲的护甲加成与MEC的盔甲技术等级成比例。"
LocHelpText="获得额外的护甲取决于MEC盔甲技术水平。"
LocFlyOverText="活性装甲"
LocPromotionPopupText="<Bullet/> 虽然缺乏爆炸防护，但活性装甲通过使MEC士兵携带具有先进技术的破坏者级别装甲来弥补。<br/>"

[RM_AdvancedFireControl X2AbilityTemplate]
LocFriendlyName="火力控制"
LocLongDescription="MEC士兵的武器装备有专门的瞄准装备，能够更快更有效地获取目标，反应射击获得额外MEC命中的<Ability:AFC/>%命中。"
LocHelpText="反应射击中获得额外的命中。"
LocFlyOverText="火力控制"
LocPromotionPopupText="<Bullet/> 火力控制可以使守望专业的MEC成为致命的力量，只要他们的枪里还有子弹。<br/>"

[RM_RelocationServos X2AbilityTemplate]
LocFriendlyName="定位伺服"
LocLongDescription="MEC士兵的身体配备了专门的腿部伺服系统，可以从射击后坐力中获得能量，使其能够在正常射击后重新定位。"
LocHelpText="在正常射击后获得额外的移动点。"
LocFlyOverText="定位伺服"
LocPromotionPopupText="<Bullet/> 定位伺服系统允许MEC士兵先射击，然后移动，使得危险的战术更安全。<br/>"

[RM_RelocationServosPassive X2AbilityTemplate]
LocFriendlyName="定位伺服"
LocLongDescription="MEC士兵的身体配备了专门的腿部伺服系统，可以从射击后坐力中获得能量，使其能够在正常射击后重新定位。"
LocHelpText="在正常射击后获得额外的移动点。"
LocFlyOverText="定位伺服"
LocPromotionPopupText="<Bullet/> 定位伺服系统允许MEC士兵先射击，然后移动，使得危险的战术更安全。<br/>"


;squaddie abilities
[RM_BodyShield X2AbilityTemplate]
LocFriendlyName="躯体护盾"
LocLongDescription="MEC对最近的可见目标生成一个盾牌，对它们进行防御。"
LocHelpText="<font color='#bf1e2e'> +重型MEC+ </font> 最近的可见目标对MEC的命中和暴击率较小。"
LocFlyOverText="躯体护盾"
LocPromotionPopupText="<Bullet/> 躯体护盾不能抵抗失魂者。<br/>"

[RM_ShockAbsorbers X2AbilityTemplate]
LocFriendlyName="减震装置"
LocLongDescription=" <Ability:ShockAbsorb_Range/> 格范围内的目标对<Ability:ClassName/>造成的伤害减少<Ability:ShockAbsorbers/>% 。"
LocHelpText=" <font color='#bf1e2e'> +突击MEC+ </font> <Ability:ClassName/> 受到近战范围内的伤害减少。"
LocFlyOverText="减震装置"

[RM_MecTaunt X2AbilityTemplate]
LocFriendlyName="嘲讽"
LocLongDescription="MEC嘲讽敌人，标记自己，但也增加了+<Ability:TauntDodge/>闪避。"
LocHelpText="MEC使自己成为目标，并给他们更多的闪避。"
LocFlyOverText="嘲讽"
LocPromotionPopupText="<Bullet/> 标记效应将使MEC成为高优先级目标：小心有多少敌人将目标对准MEC。<br/>"

;random deck abilities
[RM_ExtraConditioning X2AbilityTemplate]
LocFriendlyName="调节控制论"
LocLongDescription="该单位已经为自己的战斗做了准备，给予自己额外的生命，与装备的盔甲成比例。"
LocHelpText="在任务开始时获得额外的生命值。"
LocFlyOverText="调节控制论"
LocPromotionPopupText="<Bullet/> 在战术领域，调节控制论可以成为救星。但是，它提供的血量仍然会被计算受伤时间。<br/>"

[RM_MecSprinter X2AbilityTemplate]
LocFriendlyName="充能"
LocLongDescription="额外获得+<Ability:MecSprinter/>机动性。"
LocHelpText="在任务开始时获得额外的机动性。"
LocFlyOverText="充能"
LocPromotionPopupText="<Bullet/> 充能当与其他移动性增强相结合，可以考虑一些通常不可能的极端侧翼战术。<br/>"

[ShadowOps_DangerZone X2AbilityTemplate]
LocFriendlyName="毁灭"
LocLongDescription="你的榴弹和火箭的半径增加2，你的突破口和桥联攻击能力的半径增加1。"
LocHelpText="你的榴弹和火箭的半径增加2，你的突破口和桥联攻击能力的半径增加1。"
LocFlyOverText="毁灭"
LocPromotionPopupText="<Bullet/> 毁灭提供了一个增加榴弹半径巨额增益，使它很容易击中多个单位和摧毁他们的掩体，更不用说附近的其他掩体了。<br/>"

[Supernova X2AbilityTemplate]
LocFriendlyName="超新星"
LocLongDescription="冲向某个位置，过载<ability:ClassName/>的反应堆，对附近所有的单位造成巨大的破坏。<Ability:ClassName/>将眩晕1回合。"
LocHelpText="冲向某个位置，过载<ability:ClassName/>的反应堆，对附近所有的单位造成巨大的破坏。<Ability:ClassName/>将眩晕1回合。"
LocPromotionPopupText="<Bullet/> 过载<ability:ClassName/>的反应堆，用致命的辐射淹没该地区，撕裂有机物，侵入机器人的计算机内存。<Ability:ClassName/>必须在爆炸后关闭一段时间，以便从释放的能量中恢复。<br/><Bullet/> 超新星每次任务一充能。<br/><Bullet/>  <Ability:ClassName/>可以将一个移动和超新星组合成一个动作(或者冲刺)。<br/><Bullet/> 所有附近的机器人敌人将被眩晕两个行动点。<br/>"

[Nova X2AbilityTemplate]
LocFriendlyName="新星"
LocLongDescription="释放一股能量，伤害附近所有单位。此攻击没有消耗或冷却时间，但连续的新星将伤害<Ability:ClassName/>。"
LocHelpText="炸毁附近所有单位。连续的新星将伤害<Ability:ClassName/>。"
LocPromotionPopupText="<Bullet/> 新星没有消耗或冷却时间。<br/><Bullet/> 每次任务的第一次新星攻击将对<Ability:ClassName/>造成0点伤害。<br/><Bullet/> 第一次之后的所有新星攻击都会对<Ability:ClassName/>造成一个叠加<Ability:Nova_Damage/>伤害。<br/>"


;character template
[XComMECSoldier X2CharacterTemplate]
strCharacterName="MEC士兵"
strCharacterBackgroundMale[0]="在 <XGParam:StrValue0/!CountryName/>偏远山区长大, <XGParam:StrValue1/!FirstName/> 在很小的时候就学会了生存的艺术。他被灌输了强烈的自力更生意识，渴望尽自己的一份力量夺回地球。"
strCharacterBackgroundMale[1]="人们说 <XGParam:StrValue1/!FirstName/> 在得知地球政府向外星人投降后迷失了，变得无赖。 普遍的谣言是他从那以后的大部分时间都待在<XGParam:StrValue0/!CountryName/>的家里，为了娱乐而猎杀外星人。"
strCharacterBackgroundMale[2]="<XGParam:StrValue1/!FirstName/> 在入侵期间与家人失散了。他最后一路奋力在<XGParam:StrValue0/!CountryName/>拼搏，显然在过去的几年里靠自己生存。"
strCharacterBackgroundMale[3]="出生和长大于 <XGParam:StrValue0/!CountryName/>, <XGParam:StrValue1/!FirstName/> 有点像外卡，没有正式的培训可言。他可能正是XCOM需要的那种新兵。"
strCharacterBackgroundMale[4]="部队里流传的消息是<XGParam:StrValue1/!FirstName/>实际上是一个囚犯，直到最近才被关押在<XGParam:StrValue0/!CountryName/>。 自从获释后，他就因为从敌方战斗人员那里收集战利品而名声大噪。"
strCharacterBackgroundMale[5]="<XGParam:StrValue1/!FirstName/> 表现得像个退伍军人，但一直不愿透露他过去在<XGParam:StrValue0/!CountryName/>服役的细节 。狱警布拉德福德注：让狗睡吧。"
strCharacterBackgroundMale[6]="作为非正规民兵装备的一部分，<XGParam:StrValue0/!CountryName/>简称勇士，<XGParam:StrValue1/!FirstName/> 受了伤，后来被变种人俘虏了。我们不太清楚为什么他没有和其他囚犯一起被处理。" 
strCharacterBackgroundMale[7]="回到 <XGParam:StrValue0/!CountryName/>, <XGParam:StrValue1/!FirstName/> 关于他参与秘密军事行动的传言由来已久。未来几周他将有很多机会证明自己。" 
strCharacterBackgroundMale[8]="抵抗运动中有人担心，有人猜测最近几名新兵可能实际上是从<XGParam:StrValue0/!CountryName/>一个戒备森严的监狱设施越狱的 . <XGParam:StrValue1/!FirstName/> 在他们可能的被拘留者名单上，但在这一点上，我们不能拒绝熟练的战士，不管他们去过哪里。"
strCharacterBackgroundMale[9]="<XGParam:StrValue1/!FirstName/> 在<XGParam:StrValue0/!CountryName/>一座城市中心外被外星部队抓获。他用一辆偷来的车冲撞了一座安防塔，希望能把它连根拔起。显然没有成功，但我们喜欢他的天性。"  
strCharacterBackgroundFemale[0]="在 <XGParam:StrValue0/!CountryName/>偏远山区长大, <XGParam:StrValue1/!FirstName/> 在很小的时候就学会了生存的艺术。他被灌输了强烈的自力更生意识，渴望尽自己的一份力量夺回地球。"
strCharacterBackgroundFemale[1]="人们说 <XGParam:StrValue1/!FirstName/> 在得知地球政府向外星人投降后迷失了，变得无赖。 普遍的谣言是他从那以后的大部分时间都待在<XGParam:StrValue0/!CountryName/>的家里，为了娱乐而猎杀外星人。"
strCharacterBackgroundFemale[2]="<XGParam:StrValue1/!FirstName/> 在入侵期间与家人失散了。他最后一路奋力在<XGParam:StrValue0/!CountryName/>拼搏，显然在过去的几年里靠自己生存。"
strCharacterBackgroundFemale[3]="出生和长大于 <XGParam:StrValue0/!CountryName/>, <XGParam:StrValue1/!FirstName/> 有点像外卡，没有正式的培训可言。他可能正是XCOM需要的那种新兵。" 
strCharacterBackgroundFemale[4]="部队里流传的消息是<XGParam:StrValue1/!FirstName/>实际上是一个囚犯，直到最近才被关押在<XGParam:StrValue0/!CountryName/>。 自从获释后，他就因为从敌方战斗人员那里收集战利品而名声大噪。"
strCharacterBackgroundFemale[5]="<XGParam:StrValue1/!FirstName/> 表现得像个退伍军人，但一直不愿透露他过去在<XGParam:StrValue0/!CountryName/>服役的细节 。狱警布拉德福德注：让狗睡吧。"
strCharacterBackgroundFemale[6]="作为非正规民兵装备的一部分，<XGParam:StrValue0/!CountryName/>简称勇士，<XGParam:StrValue1/!FirstName/> 受了伤，后来被变种人俘虏了。我们不太清楚为什么他没有和其他囚犯一起被处理。" 
strCharacterBackgroundFemale[7]="回到 <XGParam:StrValue0/!CountryName/>, <XGParam:StrValue1/!FirstName/> 关于他参与秘密军事行动的传言由来已久。未来几周他将有很多机会证明自己。"  
strCharacterBackgroundFemale[8]=""抵抗运动中有人担心，有人猜测最近几名新兵可能实际上是从<XGParam:StrValue0/!CountryName/>一个戒备森严的监狱设施越狱的 . <XGParam:StrValue1/!FirstName/> 在他们可能的被拘留者名单上，但在这一点上，我们不能拒绝熟练的战士，不管他们去过哪里。"
strCharacterBackgroundFemale[9]="<XGParam:StrValue1/!FirstName/> 在<XGParam:StrValue0/!CountryName/>一座城市中心外被外星部队抓获。他用一辆偷来的车冲撞了一座安防塔，希望能把它连根拔起。显然没有成功，但我们喜欢他的天性。" 



;class text
[RM_DefaultMecTrooper X2SoldierClassTemplate]
DisplayName="支援MEC"
ClassSummary="混合了人类和机器，支援MEC专精侵入变种人系统或机械单位，以及提供掩护火力。"
LeftAbilityTreeTitle="Reprogram"
RightAbilityTreeTitle="Pressure"

AbilityTreeTitles[0]="重新编程"
AbilityTreeTitles[1]="守护者"
AbilityTreeTitles[2]="施压者"
AbilityTreeTitles[3]="医疗"


RandomNickNames[0]="罗克"
RandomNickNames[1]="主教"
RandomNickNames[2]="龙骑兵"
RandomNickNames[3]="追随者"
RandomNickNames[4]="重甲兵"
RandomNickNames[5]="百夫长"
RandomNickNames[6]="总督"
RandomNickNames[7]="军刀"
RandomNickNames[8]="贼鸥"
RandomNickNames[9]="矢量"
RandomNickNames[10]="泰坦"
RandomNickNames[11]="阔刀"
RandomNickNames[12]="猎鹰"
RandomNickNames[13]="长剑"
RandomNickNames[14]="晨星"
RandomNickNames[15]="剑"
RandomNickNames[16]="戟"
RandomNickNames[17]="标枪"
RandomNickNames[18]="系列"
RandomNickNames[19]="正宗"
RandomNickNames[20]="神剑"
RandomNickNames[21]="永恒"
RandomNickNames[22]="公司"
RandomNickNames[23]="神鬼"
RandomNickNames[24]="弯刀"
RandomNickNames[25]="三叉戟"
RandomNickNames[26]="镰刀"
RandomNickNames[27]="蚁蛾"
RandomNickNames[28]="代码"
RandomNickNames[29]="毁灭者"
RandomNickNames[30]="终结者"
RandomNickNames[31]="铁锈桶"
RandomNickNames[32]="破碎机"
RandomNickNames[33]="守护者"
RandomNickNames[34]="垃圾场"
RandomNickNames[35]="废料"


;ALPHABETICAL ORDER
RandomNickNames_Male[0]="大老爹"
RandomNickNames_Male[1]="铁人"
RandomNickNames_Male[2]="叉车"
RandomNickNames_Male[3]="泥人"
RandomNickNames_Male[4]="卡列班"
RandomNickNames_Male[5]="公爵"

;ALPHABETICAL ORDER
RandomNickNames_Female[0]="雅典娜"
RandomNickNames_Female[1]="女公爵"
RandomNicknames_Female[2]="铁娘子"
RandomNicknames_Female[3]="铁处女"
RandomNicknames_Female[4]="盾牌少女"
RandomNickNames_Female[5]="瓦尔基里"
RandomNickNames_Female[6]="大姐大"

;ALPHABETICAL ORDER
PhotoboothSoloBLines_Male[0]="他的拳头，他们的骨折！"
PhotoboothSoloBLines_Male[1]="这个坏孩子能打那么多拳。"
PhotoboothSoloBLines_Male[2]="这个MEC杀死外星人。"
PhotoboothSoloBLines_Male[3]="他不需要掩护。"
PhotoboothSoloBLines_Male[4]="一门大炮。他的拳头。他能杀死的所有外星人。"

PhotoboothSoloBLines_Female[0]="她的拳头，他们的骨折！"
PhotoboothSoloBLines_Female[1]="这个坏女孩能打那么多拳。"
PhotoboothSoloBLines_Female[2]="这个MEC杀死外星人。"
PhotoboothSoloBLines_Female[3]="她不需要掩护。"
PhotoboothSoloBLines_Female[4]="一门大炮。她的拳头。她能杀死的所有外星人。"

[RM_CannonMecTrooper X2SoldierClassTemplate]
DisplayName="重型MEC"
ClassSummary="混合了人类和机器，重型MEC擅长控制长时间的交火，并且擅长摧毁掩体。"
LeftAbilityTreeTitle="Shogun"
RightAbilityTreeTitle="Goliath"

AbilityTreeTitles[0]="幕府将军"
AbilityTreeTitles[1]="瓦尔基里"
AbilityTreeTitles[2]="歌利亚"
AbilityTreeTitles[3]="战争迷雾"


RandomNickNames[0]="罗克"
RandomNickNames[1]="主教"
RandomNickNames[2]="龙骑兵"
RandomNickNames[3]="追随者"
RandomNickNames[4]="重甲兵"
RandomNickNames[5]="百夫长"
RandomNickNames[6]="总督"
RandomNickNames[7]="军刀"
RandomNickNames[8]="贼鸥"
RandomNickNames[9]="矢量"
RandomNickNames[10]="泰坦"
RandomNickNames[11]="阔刀"
RandomNickNames[12]="猎鹰"
RandomNickNames[13]="长剑"
RandomNickNames[14]="晨星"
RandomNickNames[15]="剑"
RandomNickNames[16]="戟"
RandomNickNames[17]="标枪"
RandomNickNames[18]="系列"
RandomNickNames[19]="正宗"
RandomNickNames[20]="神剑"
RandomNickNames[21]="永恒"
RandomNickNames[22]="公司"
RandomNickNames[23]="神鬼"
RandomNickNames[24]="弯刀"
RandomNickNames[25]="三叉戟"
RandomNickNames[26]="镰刀"
RandomNickNames[27]="蚁蛾"
RandomNickNames[28]="代码"
RandomNickNames[29]="毁灭者"
RandomNickNames[30]="终结者"
RandomNickNames[31]="铁锈桶"
RandomNickNames[32]="破碎机"
RandomNickNames[33]="守护者"
RandomNickNames[34]="垃圾场"
RandomNickNames[35]="废料"


;ALPHABETICAL ORDER
RandomNickNames_Male[0]="大老爹"
RandomNickNames_Male[1]="铁人"
RandomNickNames_Male[2]="叉车"
RandomNickNames_Male[3]="泥人"
RandomNickNames_Male[4]="卡列班"
RandomNickNames_Male[5]="公爵"

;ALPHABETICAL ORDER
RandomNickNames_Female[0]="雅典娜"
RandomNickNames_Female[1]="女公爵"
RandomNicknames_Female[2]="铁娘子"
RandomNicknames_Female[3]="铁处女"
RandomNicknames_Female[4]="盾牌少女"
RandomNickNames_Female[5]="瓦尔基里"
RandomNickNames_Female[6]="大姐大"

;ALPHABETICAL ORDER
PhotoboothSoloBLines_Male[0]="他的拳头，他们的骨折！"
PhotoboothSoloBLines_Male[1]="这个坏孩子能打那么多拳。"
PhotoboothSoloBLines_Male[2]="这个MEC杀死外星人。"
PhotoboothSoloBLines_Male[3]="他不需要掩护。"
PhotoboothSoloBLines_Male[4]="一门大炮。他的拳头。他能杀死的所有外星人。"

PhotoboothSoloBLines_Female[0]="她的拳头，他们的骨折！"
PhotoboothSoloBLines_Female[1]="这个坏女孩能打那么多拳。"
PhotoboothSoloBLines_Female[2]="这个MEC杀死外星人。"
PhotoboothSoloBLines_Female[3]="她不需要掩护。"
PhotoboothSoloBLines_Female[4]="一门大炮。她的拳头。她能杀死的所有外星人。"


[RM_SniperMecTrooper X2SoldierClassTemplate]
DisplayName="狙击MEC"
ClassSummary="狙击MEC集人与机于一身，擅长从远处精确射击，也能帮助其他队员击中目标。"
LeftAbilityTreeTitle="Spotter"
RightAbilityTreeTitle="Archer"

AbilityTreeTitles[0]="观察者"
AbilityTreeTitles[1]="耶格"
AbilityTreeTitles[2]="弓箭手"
AbilityTreeTitles[3]="投石车"


RandomNickNames[0]="罗克"
RandomNickNames[1]="主教"
RandomNickNames[2]="龙骑兵"
RandomNickNames[3]="追随者"
RandomNickNames[4]="重甲兵"
RandomNickNames[5]="百夫长"
RandomNickNames[6]="总督"
RandomNickNames[7]="军刀"
RandomNickNames[8]="贼鸥"
RandomNickNames[9]="矢量"
RandomNickNames[10]="泰坦"
RandomNickNames[11]="阔刀"
RandomNickNames[12]="猎鹰"
RandomNickNames[13]="长剑"
RandomNickNames[14]="晨星"
RandomNickNames[15]="剑"
RandomNickNames[16]="戟"
RandomNickNames[17]="标枪"
RandomNickNames[18]="系列"
RandomNickNames[19]="正宗"
RandomNickNames[20]="神剑"
RandomNickNames[21]="永恒"
RandomNickNames[22]="公司"
RandomNickNames[23]="神鬼"
RandomNickNames[24]="弯刀"
RandomNickNames[25]="三叉戟"
RandomNickNames[26]="镰刀"
RandomNickNames[27]="蚁蛾"
RandomNickNames[28]="代码"
RandomNickNames[29]="毁灭者"
RandomNickNames[30]="终结者"
RandomNickNames[31]="铁锈桶"
RandomNickNames[32]="破碎机"
RandomNickNames[33]="守护者"
RandomNickNames[34]="垃圾场"
RandomNickNames[35]="废料"


;ALPHABETICAL ORDER
RandomNickNames_Male[0]="大老爹"
RandomNickNames_Male[1]="铁人"
RandomNickNames_Male[2]="叉车"
RandomNickNames_Male[3]="泥人"
RandomNickNames_Male[4]="卡列班"
RandomNickNames_Male[5]="公爵"

;ALPHABETICAL ORDER
RandomNickNames_Female[0]="雅典娜"
RandomNickNames_Female[1]="女公爵"
RandomNicknames_Female[2]="铁娘子"
RandomNicknames_Female[3]="铁处女"
RandomNicknames_Female[4]="盾牌少女"
RandomNickNames_Female[5]="瓦尔基里"
RandomNickNames_Female[6]="大姐大"

;ALPHABETICAL ORDER
PhotoboothSoloBLines_Male[0]="他的拳头，他们的骨折！"
PhotoboothSoloBLines_Male[1]="这个坏孩子能打那么多拳。"
PhotoboothSoloBLines_Male[2]="这个MEC杀死外星人。"
PhotoboothSoloBLines_Male[3]="他不需要掩护。"
PhotoboothSoloBLines_Male[4]="一门大炮。他的拳头。他能杀死的所有外星人。"

PhotoboothSoloBLines_Female[0]="她的拳头，他们的骨折！"
PhotoboothSoloBLines_Female[1]="这个坏女孩能打那么多拳。"
PhotoboothSoloBLines_Female[2]="这个MEC杀死外星人。"
PhotoboothSoloBLines_Female[3]="她不需要掩护。"
PhotoboothSoloBLines_Female[4]="一门大炮。她的拳头。她能杀死的所有外星人。"



[RM_ShotgunMecTrooper X2SoldierClassTemplate]
DisplayName="突击MEC"
ClassSummary="混合了人类和机器，突击MEC擅长于快速覆盖距离和近距离猛烈打击敌人。"
LeftAbilityTreeTitle="Marauder"
RightAbilityTreeTitle="Pathfinder"

AbilityTreeTitles[0]="战士"
AbilityTreeTitles[1]="掠夺者"
AbilityTreeTitles[2]="探路者"
AbilityTreeTitles[3]="泰坦"


RandomNickNames[0]="罗克"
RandomNickNames[1]="主教"
RandomNickNames[2]="龙骑兵"
RandomNickNames[3]="追随者"
RandomNickNames[4]="重甲兵"
RandomNickNames[5]="百夫长"
RandomNickNames[6]="总督"
RandomNickNames[7]="军刀"
RandomNickNames[8]="贼鸥"
RandomNickNames[9]="矢量"
RandomNickNames[10]="泰坦"
RandomNickNames[11]="阔刀"
RandomNickNames[12]="猎鹰"
RandomNickNames[13]="长剑"
RandomNickNames[14]="晨星"
RandomNickNames[15]="剑"
RandomNickNames[16]="戟"
RandomNickNames[17]="标枪"
RandomNickNames[18]="系列"
RandomNickNames[19]="正宗"
RandomNickNames[20]="神剑"
RandomNickNames[21]="永恒"
RandomNickNames[22]="公司"
RandomNickNames[23]="神鬼"
RandomNickNames[24]="弯刀"
RandomNickNames[25]="三叉戟"
RandomNickNames[26]="镰刀"
RandomNickNames[27]="蚁蛾"
RandomNickNames[28]="代码"
RandomNickNames[29]="毁灭者"
RandomNickNames[30]="终结者"
RandomNickNames[31]="铁锈桶"
RandomNickNames[32]="破碎机"
RandomNickNames[33]="守护者"
RandomNickNames[34]="垃圾场"
RandomNickNames[35]="废料"


;ALPHABETICAL ORDER
RandomNickNames_Male[0]="大老爹"
RandomNickNames_Male[1]="铁人"
RandomNickNames_Male[2]="叉车"
RandomNickNames_Male[3]="泥人"
RandomNickNames_Male[4]="卡列班"
RandomNickNames_Male[5]="公爵"

;ALPHABETICAL ORDER
RandomNickNames_Female[0]="雅典娜"
RandomNickNames_Female[1]="女公爵"
RandomNicknames_Female[2]="铁娘子"
RandomNicknames_Female[3]="铁处女"
RandomNicknames_Female[4]="盾牌少女"
RandomNickNames_Female[5]="瓦尔基里"
RandomNickNames_Female[6]="大姐大"

;ALPHABETICAL ORDER
PhotoboothSoloBLines_Male[0]="他的拳头，他们的骨折！"
PhotoboothSoloBLines_Male[1]="这个坏孩子能打那么多拳。"
PhotoboothSoloBLines_Male[2]="这个MEC杀死外星人。"
PhotoboothSoloBLines_Male[3]="他不需要掩护。"
PhotoboothSoloBLines_Male[4]="一门大炮。他的拳头。他能杀死的所有外星人。"

PhotoboothSoloBLines_Female[0]="她的拳头，他们的骨折！"
PhotoboothSoloBLines_Female[1]="这个坏女孩能打那么多拳。"
PhotoboothSoloBLines_Female[2]="这个MEC杀死外星人。"
PhotoboothSoloBLines_Female[3]="她不需要掩护。"
PhotoboothSoloBLines_Female[4]="一门大炮。她的拳头。她能杀死的所有外星人。"

[RM_ChemthrowerMecTrooper X2SoldierClassTemplate]
DisplayName="暴徒MEC"
ClassSummary="作为人类和机器的混合体，暴徒MEC专门使用焚化装置来歼灭或削弱敌人群体，并且可以携带大量的化合罐。"
LeftAbilityTreeTitle="融化"
RightAbilityTreeTitle="九头蛇"

AbilityTreeTitles[0]="熔化"
AbilityTreeTitles[1]="狂人"
AbilityTreeTitles[2]="九头蛇"
AbilityTreeTitles[3]="危险分子"


RandomNickNames[0]="罗克"
RandomNickNames[1]="主教"
RandomNickNames[2]="龙骑兵"
RandomNickNames[3]="追随者"
RandomNickNames[4]="重甲兵"
RandomNickNames[5]="百夫长"
RandomNickNames[6]="总督"
RandomNickNames[7]="军刀"
RandomNickNames[8]="贼鸥"
RandomNickNames[9]="矢量"
RandomNickNames[10]="泰坦"
RandomNickNames[11]="阔刀"
RandomNickNames[12]="猎鹰"
RandomNickNames[13]="长剑"
RandomNickNames[14]="晨星"
RandomNickNames[15]="剑"
RandomNickNames[16]="戟"
RandomNickNames[17]="标枪"
RandomNickNames[18]="系列"
RandomNickNames[19]="正宗"
RandomNickNames[20]="神剑"
RandomNickNames[21]="永恒"
RandomNickNames[22]="公司"
RandomNickNames[23]="神鬼"
RandomNickNames[24]="弯刀"
RandomNickNames[25]="三叉戟"
RandomNickNames[26]="镰刀"
RandomNickNames[27]="蚁蛾"
RandomNickNames[28]="代码"
RandomNickNames[29]="毁灭者"
RandomNickNames[30]="终结者"
RandomNickNames[31]="铁锈桶"
RandomNickNames[32]="破碎机"
RandomNickNames[33]="守护者"
RandomNickNames[34]="垃圾场"
RandomNickNames[35]="废料"


;ALPHABETICAL ORDER
RandomNickNames_Male[0]="大老爹"
RandomNickNames_Male[1]="铁人"
RandomNickNames_Male[2]="叉车"
RandomNickNames_Male[3]="泥人"
RandomNickNames_Male[4]="卡列班"
RandomNickNames_Male[5]="公爵"

;ALPHABETICAL ORDER
RandomNickNames_Female[0]="雅典娜"
RandomNickNames_Female[1]="女公爵"
RandomNicknames_Female[2]="铁娘子"
RandomNicknames_Female[3]="铁处女"
RandomNicknames_Female[4]="盾牌少女"
RandomNickNames_Female[5]="瓦尔基里"
RandomNickNames_Female[6]="大姐大"

;ALPHABETICAL ORDER
PhotoboothSoloBLines_Male[0]="他的拳头，他们的骨折！"
PhotoboothSoloBLines_Male[1]="这个坏孩子能打那么多拳。"
PhotoboothSoloBLines_Male[2]="这个MEC杀死外星人。"
PhotoboothSoloBLines_Male[3]="他不需要掩护。"
PhotoboothSoloBLines_Male[4]="一门大炮。他的拳头。他能杀死的所有外星人。"

PhotoboothSoloBLines_Female[0]="她的拳头，他们的骨折！"
PhotoboothSoloBLines_Female[1]="这个坏女孩能打那么多拳。"
PhotoboothSoloBLines_Female[2]="这个MEC杀死外星人。"
PhotoboothSoloBLines_Female[3]="她不需要掩护。"
PhotoboothSoloBLines_Female[4]="一门大炮。她的拳头。她能杀死的所有外星人。"

[RM_ShieldMecTrooper X2SoldierClassTemplate]
DisplayName="守护MEC"
ClassSummary="作为人类和机器的混合体，守护MEC专门使用盾牌来阻止敌人的攻击，并保护小队其他人的安全。"
LeftAbilityTreeTitle="Fortification"
RightAbilityTreeTitle="Primal"

AbilityTreeTitles[0]="防御工事"
AbilityTreeTitles[1]="破门者"
AbilityTreeTitles[2]="原生者"
AbilityTreeTitles[3]="痛苦列车"


RandomNickNames[0]="罗克"
RandomNickNames[1]="主教"
RandomNickNames[2]="龙骑兵"
RandomNickNames[3]="追随者"
RandomNickNames[4]="重甲兵"
RandomNickNames[5]="百夫长"
RandomNickNames[6]="总督"
RandomNickNames[7]="军刀"
RandomNickNames[8]="贼鸥"
RandomNickNames[9]="矢量"
RandomNickNames[10]="泰坦"
RandomNickNames[11]="阔刀"
RandomNickNames[12]="猎鹰"
RandomNickNames[13]="长剑"
RandomNickNames[14]="晨星"
RandomNickNames[15]="剑"
RandomNickNames[16]="戟"
RandomNickNames[17]="标枪"
RandomNickNames[18]="系列"
RandomNickNames[19]="正宗"
RandomNickNames[20]="神剑"
RandomNickNames[21]="永恒"
RandomNickNames[22]="公司"
RandomNickNames[23]="神鬼"
RandomNickNames[24]="弯刀"
RandomNickNames[25]="三叉戟"
RandomNickNames[26]="镰刀"
RandomNickNames[27]="蚁蛾"
RandomNickNames[28]="代码"
RandomNickNames[29]="毁灭者"
RandomNickNames[30]="终结者"
RandomNickNames[31]="铁锈桶"
RandomNickNames[32]="破碎机"
RandomNickNames[33]="守护者"
RandomNickNames[34]="垃圾场"
RandomNickNames[35]="废料"


;ALPHABETICAL ORDER
RandomNickNames_Male[0]="大老爹"
RandomNickNames_Male[1]="铁人"
RandomNickNames_Male[2]="叉车"
RandomNickNames_Male[3]="泥人"
RandomNickNames_Male[4]="卡列班"
RandomNickNames_Male[5]="公爵"

;ALPHABETICAL ORDER
RandomNickNames_Female[0]="雅典娜"
RandomNickNames_Female[1]="女公爵"
RandomNicknames_Female[2]="铁娘子"
RandomNicknames_Female[3]="铁处女"
RandomNicknames_Female[4]="盾牌少女"
RandomNickNames_Female[5]="瓦尔基里"
RandomNickNames_Female[6]="大姐大"

;ALPHABETICAL ORDER
PhotoboothSoloBLines_Male[0]="他的拳头，他们的骨折！"
PhotoboothSoloBLines_Male[1]="这个坏孩子能打那么多拳。"
PhotoboothSoloBLines_Male[2]="这个MEC杀死外星人。"
PhotoboothSoloBLines_Male[3]="他不需要掩护。"
PhotoboothSoloBLines_Male[4]="一门大炮。他的拳头。他能杀死的所有外星人。"

PhotoboothSoloBLines_Female[0]="她的拳头，他们的骨折！"
PhotoboothSoloBLines_Female[1]="这个坏女孩能打那么多拳。"
PhotoboothSoloBLines_Female[2]="这个MEC杀死外星人。"
PhotoboothSoloBLines_Female[3]="她不需要掩护。"
PhotoboothSoloBLines_Female[4]="一门大炮。她的拳头。她能杀死的所有外星人。"

[RM_ReaperMecTrooper X2SoldierClassTemplate]
DisplayName="死神MEC"
ClassSummary="死神MEC是人和机器的混合体，擅长隐身和瓦解敌人。"
LeftAbilityTreeTitle="Stealth"
RightAbilityTreeTitle="Marksman"

AbilityTreeTitles[0]="秘密行动"
AbilityTreeTitles[1]="破坏者"
AbilityTreeTitles[2]="神枪手"
AbilityTreeTitles[3]="XCOM"


RandomNickNames[0]="罗克"
RandomNickNames[1]="主教"
RandomNickNames[2]="龙骑兵"
RandomNickNames[3]="追随者"
RandomNickNames[4]="重甲兵"
RandomNickNames[5]="百夫长"
RandomNickNames[6]="总督"
RandomNickNames[7]="军刀"
RandomNickNames[8]="贼鸥"
RandomNickNames[9]="矢量"
RandomNickNames[10]="泰坦"
RandomNickNames[11]="阔刀"
RandomNickNames[12]="猎鹰"
RandomNickNames[13]="长剑"
RandomNickNames[14]="晨星"
RandomNickNames[15]="剑"
RandomNickNames[16]="戟"
RandomNickNames[17]="标枪"
RandomNickNames[18]="系列"
RandomNickNames[19]="正宗"
RandomNickNames[20]="神剑"
RandomNickNames[21]="永恒"
RandomNickNames[22]="公司"
RandomNickNames[23]="神鬼"
RandomNickNames[24]="弯刀"
RandomNickNames[25]="三叉戟"
RandomNickNames[26]="镰刀"
RandomNickNames[27]="蚁蛾"
RandomNickNames[28]="代码"
RandomNickNames[29]="毁灭者"
RandomNickNames[30]="终结者"
RandomNickNames[31]="铁锈桶"
RandomNickNames[32]="破碎机"
RandomNickNames[33]="守护者"
RandomNickNames[34]="垃圾场"
RandomNickNames[35]="废料"


;ALPHABETICAL ORDER
RandomNickNames_Male[0]="大老爹"
RandomNickNames_Male[1]="铁人"
RandomNickNames_Male[2]="叉车"
RandomNickNames_Male[3]="泥人"
RandomNickNames_Male[4]="卡列班"
RandomNickNames_Male[5]="公爵"

;ALPHABETICAL ORDER
RandomNickNames_Female[0]="雅典娜"
RandomNickNames_Female[1]="女公爵"
RandomNicknames_Female[2]="铁娘子"
RandomNicknames_Female[3]="铁处女"
RandomNicknames_Female[4]="盾牌少女"
RandomNickNames_Female[5]="瓦尔基里"
RandomNickNames_Female[6]="大姐大"

;ALPHABETICAL ORDER
PhotoboothSoloBLines_Male[0]="他的拳头，他们的骨折！"
PhotoboothSoloBLines_Male[1]="这个坏孩子能打那么多拳。"
PhotoboothSoloBLines_Male[2]="这个MEC杀死外星人。"
PhotoboothSoloBLines_Male[3]="他不需要掩护。"
PhotoboothSoloBLines_Male[4]="一门大炮。他的拳头。他能杀死的所有外星人。"

PhotoboothSoloBLines_Female[0]="她的拳头，他们的骨折！"
PhotoboothSoloBLines_Female[1]="这个坏女孩能打那么多拳。"
PhotoboothSoloBLines_Female[2]="这个MEC杀死外星人。"
PhotoboothSoloBLines_Female[3]="她不需要掩护。"
PhotoboothSoloBLines_Female[4]="一门大炮。她的拳头。她能杀死的所有外星人。"



[RM_SkirmisherMecTrooper X2SoldierClassTemplate]
DisplayName="散兵MEC"
ClassSummary="混合了动力和机器，散兵MEC擅长前线战斗和无情的攻击。"
LeftAbilityTreeTitle="Hussar"
RightAbilityTreeTitle="Tactician"

AbilityTreeTitles[0]="轻骑兵"
AbilityTreeTitles[1]="审判员"
AbilityTreeTitles[2]="战术家"
AbilityTreeTitles[3]="XCOM"


RandomNickNames[0]="罗克"
RandomNickNames[1]="主教"
RandomNickNames[2]="龙骑兵"
RandomNickNames[3]="追随者"
RandomNickNames[4]="重甲兵"
RandomNickNames[5]="百夫长"
RandomNickNames[6]="总督"
RandomNickNames[7]="军刀"
RandomNickNames[8]="贼鸥"
RandomNickNames[9]="矢量"
RandomNickNames[10]="泰坦"
RandomNickNames[11]="阔刀"
RandomNickNames[12]="猎鹰"
RandomNickNames[13]="长剑"
RandomNickNames[14]="晨星"
RandomNickNames[15]="剑"
RandomNickNames[16]="戟"
RandomNickNames[17]="标枪"
RandomNickNames[18]="系列"
RandomNickNames[19]="正宗"
RandomNickNames[20]="神剑"
RandomNickNames[21]="永恒"
RandomNickNames[22]="公司"
RandomNickNames[23]="神鬼"
RandomNickNames[24]="弯刀"
RandomNickNames[25]="三叉戟"
RandomNickNames[26]="镰刀"
RandomNickNames[27]="蚁蛾"
RandomNickNames[28]="代码"
RandomNickNames[29]="毁灭者"
RandomNickNames[30]="终结者"
RandomNickNames[31]="铁锈桶"
RandomNickNames[32]="破碎机"
RandomNickNames[33]="守护者"
RandomNickNames[34]="垃圾场"
RandomNickNames[35]="废料"


;ALPHABETICAL ORDER
RandomNickNames_Male[0]="大老爹"
RandomNickNames_Male[1]="铁人"
RandomNickNames_Male[2]="叉车"
RandomNickNames_Male[3]="泥人"
RandomNickNames_Male[4]="卡列班"
RandomNickNames_Male[5]="公爵"

;ALPHABETICAL ORDER
RandomNickNames_Female[0]="雅典娜"
RandomNickNames_Female[1]="女公爵"
RandomNicknames_Female[2]="铁娘子"
RandomNicknames_Female[3]="铁处女"
RandomNicknames_Female[4]="盾牌少女"
RandomNickNames_Female[5]="瓦尔基里"
RandomNickNames_Female[6]="大姐大"

;ALPHABETICAL ORDER
PhotoboothSoloBLines_Male[0]="他的拳头，他们的骨折！"
PhotoboothSoloBLines_Male[1]="这个坏孩子能打那么多拳。"
PhotoboothSoloBLines_Male[2]="这个MEC杀死外星人。"
PhotoboothSoloBLines_Male[3]="他不需要掩护。"
PhotoboothSoloBLines_Male[4]="一门大炮。他的拳头。他能杀死的所有外星人。"

PhotoboothSoloBLines_Female[0]="她的拳头，他们的骨折！"
PhotoboothSoloBLines_Female[1]="这个坏女孩能打那么多拳。"
PhotoboothSoloBLines_Female[2]="这个MEC杀死外星人。"
PhotoboothSoloBLines_Female[3]="她不需要掩护。"
PhotoboothSoloBLines_Female[4]="一门大炮。她的拳头。她能杀死的所有外星人。"

[RM_TemplarMecTrooper X2SoldierClassTemplate]
DisplayName="圣殿骑士MEC"
ClassSummary="混合了人类和机器，圣殿骑士MEC擅长近战和电子攻击的小精灵。他们也保留一定程度的灵能能力。"
LeftAbilityTreeTitle="Power Fist"
RightAbilityTreeTitle="Sage"

AbilityTreeTitles[0]="动力拳套"
AbilityTreeTitles[1]="发电机"
AbilityTreeTitles[2]="圣人"
AbilityTreeTitles[3]="XCOM"


RandomNickNames[0]="罗克"
RandomNickNames[1]="主教"
RandomNickNames[2]="龙骑兵"
RandomNickNames[3]="追随者"
RandomNickNames[4]="重甲兵"
RandomNickNames[5]="百夫长"
RandomNickNames[6]="总督"
RandomNickNames[7]="军刀"
RandomNickNames[8]="贼鸥"
RandomNickNames[9]="矢量"
RandomNickNames[10]="泰坦"
RandomNickNames[11]="阔刀"
RandomNickNames[12]="猎鹰"
RandomNickNames[13]="长剑"
RandomNickNames[14]="晨星"
RandomNickNames[15]="剑"
RandomNickNames[16]="戟"
RandomNickNames[17]="标枪"
RandomNickNames[18]="系列"
RandomNickNames[19]="正宗"
RandomNickNames[20]="神剑"
RandomNickNames[21]="永恒"
RandomNickNames[22]="公司"
RandomNickNames[23]="神鬼"
RandomNickNames[24]="弯刀"
RandomNickNames[25]="三叉戟"
RandomNickNames[26]="镰刀"
RandomNickNames[27]="蚁蛾"
RandomNickNames[28]="代码"
RandomNickNames[29]="毁灭者"
RandomNickNames[30]="终结者"
RandomNickNames[31]="铁锈桶"
RandomNickNames[32]="破碎机"
RandomNickNames[33]="守护者"
RandomNickNames[34]="垃圾场"
RandomNickNames[35]="废料"


;ALPHABETICAL ORDER
RandomNickNames_Male[0]="大老爹"
RandomNickNames_Male[1]="铁人"
RandomNickNames_Male[2]="叉车"
RandomNickNames_Male[3]="泥人"
RandomNickNames_Male[4]="卡列班"
RandomNickNames_Male[5]="公爵"

;ALPHABETICAL ORDER
RandomNickNames_Female[0]="雅典娜"
RandomNickNames_Female[1]="女公爵"
RandomNicknames_Female[2]="铁娘子"
RandomNicknames_Female[3]="铁处女"
RandomNicknames_Female[4]="盾牌少女"
RandomNickNames_Female[5]="瓦尔基里"
RandomNickNames_Female[6]="大姐大"

;ALPHABETICAL ORDER
PhotoboothSoloBLines_Male[0]="他的拳头，他们的骨折！"
PhotoboothSoloBLines_Male[1]="这个坏孩子能打那么多拳。"
PhotoboothSoloBLines_Male[2]="这个MEC杀死外星人。"
PhotoboothSoloBLines_Male[3]="他不需要掩护。"
PhotoboothSoloBLines_Male[4]="一门大炮。他的拳头。他能杀死的所有外星人。"

PhotoboothSoloBLines_Female[0]="她的拳头，他们的骨折！"
PhotoboothSoloBLines_Female[1]="这个坏女孩能打那么多拳。"
PhotoboothSoloBLines_Female[2]="这个MEC杀死外星人。"
PhotoboothSoloBLines_Female[3]="她不需要掩护。"
PhotoboothSoloBLines_Female[4]="一门大炮。她的拳头。她能杀死的所有外星人。"

[MecRend X2AbilityTemplate]
LocFriendlyName="撕裂重拳"
LocLongDescription="对移动范围内任何目标的一种攻击，在攻击后提供一个动量行动点。每回合可使用一次。伤害取决于配备的底盘。"
LocHelpText="<font color='#bf1e2e'> +圣殿骑士MEC+ </font> 在移动范围内打击任何目标。攻击后获得动量行动点。"
LocPromotionPopupText="<Bullet/> 你可以通过将移动光标放在敌人身上触发撕裂重拳技能。<br/><Bullet/> 圣殿骑士MEC可以执行“冲刺”移动，使用两个行动点移动，但仍然会触发对相邻敌人的撕裂重拳。<br/><Bullet/> 撕碎重击会造成8/10/12伤害，具体取决于配备的SPARK底盘。<br/><Bullet/> 撕裂重拳的命中几率是基于圣殿骑士MEC的命中+20。<br/><Bullet/> 之后获得动量行动点，可用于移动。<br/><Bullet/> 每回合可使用一次。<br/>"

[OneTwoPunch X2AbilityTemplate]
LocFriendlyName="一拳两拳"
LocLongDescription="一种只造成一半伤害的攻击，不能与移动一起使用，但使用动量行动点而不是标准行动点。每回合可使用一次。"
LocHelpText="对相邻目标造成一半拳击伤害而不是移动。需要一个动量行动点。"
LocPromotionPopupText="<Bullet/> 一拳两拳是一种终结在不幸的擦伤后或者有很多生命值的敌人很好的方式。<br/><Bullet/> 如果你的位置恰到好处，你可以直接用你的一拳两拳攻击附近的另一个敌人，而不是用你的撕裂重拳。<br/><Bullet/> 只能在撕裂重拳攻击后获得动量行动点时使用，每回合只能使用一次。<br/>"

[DeepMist X2AbilityTemplate]
LocFriendlyName="精纯浓雾"
LocLongDescription="医疗喷雾物品获得2额外充能。"
LocHelpText="医疗喷雾物品获得2额外2额外充能。"
LocPromotionPopupText="<Bullet/> 医疗喷雾奖励充能只影响携带物品，不影响同样名称的能力。无论医疗喷雾是否部署了BIT，额外充能都会起作用。"

[MecTrooperImmunities X2AbilityTemplate]
LocFriendlyName="MEC底盘"
LocLongDescription="所有MEC士兵都对火、寄生兽毒、毒蛇束缚和击退免疫。"
LocHelpText="所有MEC士兵都对火、寄生兽毒、毒蛇束缚和击退免疫。"
LocFlyOverText="MEC底盘"


[MZChainingJolt X2AbilityTemplate]
LocFriendlyName="震荡链"
LocHelpText="派遣小精灵震电一名敌人。链接攻击目标附近的敌人。"
LocLongDescription="<Ability:ClassName/>派遣小精灵震电一名敌人。链接攻击目标附近的敌人。对机械敌人伤害增加。"
LocFlyOverText="震荡链"
LocPromotionPopupText="<Bullet/> 造成穿透护甲的电伤害。<br/><Bullet/> 如果该单位具有撕裂重拳能力，则不会结束回合。<br/><Bullet/> 不能在隐蔽状态使用。<br/><Bullet/> 只能链接到与目标单位友好的单位。<br/><Bullet/> <Ability:SelfCooldown/>回合冷却。<br/>"

[Unchained X2AbilityTemplate]
LocFriendlyName="无拘无束"
LocLongDescription="震荡链不再有回合冷却时间。"
LocHelpText="震荡链不再有回合冷却时间。"
LocFlyOverText="无拘无束"

[StrikeOut X2AbilityTemplate]
LocFriendlyName="完全打击"
LocLongDescription="打击技能不再有冷却时间"
LocHelpText="打击技能不再有冷却时间"
LocFlyOverText="完全打击"